#### Set up a new database in memory and creates a *cursor* object to execute SQL statements with it.

In [1]:
import sqlite3

conn = sqlite3.connect(':memory:')
c = conn.cursor()

#### Create a new relation (i.e., table) by specifying its schema

In [2]:
c.execute('''
CREATE TABLE Students (
  sid INTEGER, 
  name TEXT,
  login TEXT,
  age INTEGER, 
  gpa REAL)
''')

#### Create another one

In [182]:
c.execute('''
CREATE TABLE Enrolled (
sid INTEGER,
cid TEXT,
grade TEXT)
''')

#### Add some rows to the Students table

In [183]:
c.execute('''
INSERT INTO Students (sid, name, login, age, gpa)
VALUES (53666, 'Jones', 'jones@cs', 18, 3.4)
''')
c.execute('''
INSERT INTO Students (sid, name, login, age, gpa)
VALUES (53688, 'Smith', 'smith@cs', 18, 3.2)
''')
c.execute('''
INSERT INTO Students (sid, name, login, age, gpa)
VALUES (53650, 'Smith', 'smith@math', 19, 3.8)
''')

####  Example of a select statement with a qualifying where clause.
* Note that equality testing is done with a single =
* The "S" provides us with a shorthand for "Students" in other parts of the statement.
 * Don't need to use qualified column names if unambiguous otherwise.
* fetchall() retrieves all tuples of the result as an array.

In [184]:
c.execute("SELECT * FROM Students S WHERE S.age=18")
c.fetchall()

[(53666, 'Jones', 'jones@cs', 18, 3.4), (53688, 'Smith', 'smith@cs', 18, 3.2)]

#### Same thing but this time printing out each tuple by iterating over the cursor.

In [185]:
c.execute("SELECT S.name, S.login FROM Students S WHERE S.age=18")
for r in c:
    print(r)

('Jones', 'jones@cs')
('Smith', 'smith@cs')

#### Here we do one select and use fetchone() to get the first tuple of the result and then do a different select.
* Point here is that second select replaces result with respect to the cursor even though there were more tuples of the first result that hadn't been fetched yet.

In [186]:
c.execute("SELECT S.name, S.login From Students S Where S.age=18")
print(c.fetchone())
c.execute("SELECT * From Students S")
print(c.fetchone())

('Jones', 'jones@cs')
(53666, 'Jones', 'jones@cs', 18, 3.4)

#### Let's populate the Enrolled table now.

In [187]:
c.execute('''
INSERT INTO Enrolled (sid, cid, grade)
VALUES (53688, 'Carnatic101', 'C')
''')
c.execute('''
INSERT INTO Enrolled (sid, cid, grade)
VALUES (53688, 'Reggae203', 'B')
''')
c.execute('''
INSERT INTO Enrolled (sid, cid, grade)
VALUES (53650, 'Topology112', 'A')
''')
c.execute('''
INSERT INTO Enrolled (sid, cid, grade)
VALUES (53666, 'History105', 'B')
''')
c.execute('SELECT * from Enrolled')
for r in c:
    print(r)

(53688, 'Carnatic101', 'C')
(53688, 'Reggae203', 'B')
(53650, 'Topology112', 'A')
(53666, 'History105', 'B')

#### An example of a SELECT that *joins* two tables.
* We'll get into joins in more detail next week.
* Notice condition in where clause that ensures that only combinations of rows in S and E that make sense are considered.

In [188]:
c.execute('''
SELECT S.name, E.cid
FROM Students S, Enrolled E
WHERE S.sid = E.sid AND E.grade='A'
''')
for r in c:
    print(r)

('Smith', 'Topology112')

#### Add another student

In [122]:
c.execute('''
INSERT INTO Students (sid, name, login, age, gpa)
VALUES (53675, 'Smith', 'smith@phys', 18, 3.5)
''')
c.execute('SELECT * from Students')
c.fetchall()

[(53666, 'Jones', 'jones@cs', 18, 3.4),
 (53688, 'Smith', 'smith@cs', 18, 3.2),
 (53650, 'Smith', 'smith@math', 19, 3.8),
 (53675, 'Smith', 'smith@phys', 18, 3.5)]

#### Example of deleting rows.
* Where clause important to determine which rows to delete.
 * Without it, all rows would be deleted.

In [123]:
c.execute("DELETE FROM Students WHERE name = 'Smith'")
c.execute("SELECT * FROM Students S")
c.fetchall()

[(53666, 'Jones', 'jones@cs', 18, 3.4)]

### Return to lecture.

#### Now let's start over and this time add some constraints to our tables.
* Note that we must explicitly turn foreign key support on in sqlite3 if we want it to enforce those integrity constraints. By default sqlite3 won't.

In [189]:
conn = sqlite3.connect(':memory:')
c = conn.cursor()
c.execute("PRAGMA foreign_keys = 1")

c.execute('''
CREATE TABLE Students (
  sid INTEGER, 
  name TEXT,
  login TEXT,
  age INTEGER, 
  gpa REAL,
  PRIMARY KEY (sid)
)
''')
c.execute('''
CREATE TABLE Enrolled (
sid INTEGER,
cid TEXT,
grade TEXT,
PRIMARY KEY (sid, cid),
FOREIGN KEY (sid) REFERENCES Students (sid)
)
''')

#### Add some students

In [190]:
c.execute('''
INSERT INTO Students (sid, name, login, age, gpa)
VALUES (53666, 'Jones', 'jones@cs', 18, 3.4)
''')
c.execute('''
INSERT INTO Students (sid, name, login, age, gpa)
VALUES (53688, 'Smith', 'smith@cs', 18, 3.2)
''')
c.execute('''
INSERT INTO Students (sid, name, login, age, gpa)
VALUES (53650, 'Smith', 'smith@math', 19, 3.8)
''')
c.execute("SELECT * from Students")
for r in c:
    print(r)

(53650, 'Smith', 'smith@math', 19, 3.8)
(53666, 'Jones', 'jones@cs', 18, 3.4)
(53688, 'Smith', 'smith@cs', 18, 3.2)

#### Try to add another student with the same sid as an existing student.
* Primary key constraint specified in table schema prevents us from doing so.

In [191]:
c.execute('''
INSERT INTO Students (sid, name, login, age, gpa)
VALUES (53650, 'Patel', 'kmp@cs', 50, 4.0)
''')

IntegrityError: UNIQUE constraint failed: Students.sid

#### Add some rows to Enrolled

In [192]:
c.execute('''
INSERT INTO Enrolled (sid, cid, grade)
VALUES (53688, 'Carnatic101', 'C')
''')
c.execute('''
INSERT INTO Enrolled (sid, cid, grade)
VALUES (53688, 'Reggae203', 'B')
''')
c.execute('''
INSERT INTO Enrolled (sid, cid, grade)
VALUES (53650, 'Topology112', 'A')
''')
c.execute('''
INSERT INTO Enrolled (sid, cid, grade)
VALUES (53666, 'History105', 'B')
''')
c.execute("SELECT * from Enrolled")
for r in c:
    print(r)

(53688, 'Carnatic101', 'C')
(53688, 'Reggae203', 'B')
(53650, 'Topology112', 'A')
(53666, 'History105', 'B')

#### Attempt to add a row with same (sid, cid) combination as existing row.
* Again, primary key constraint specified in Enrolled schema won't allow.

In [193]:
c.execute('''
INSERT INTO Enrolled (sid, cid, grade)
VALUES (53666, 'History105', 'A')
''')

IntegrityError: UNIQUE constraint failed: Enrolled.sid, Enrolled.cid

#### Attempt to add a row to Enrolled that violates foreign key constraint
* In this case, row in Students with sid 123123 does not exist

In [194]:
c.execute('''
INSERT INTO Enrolled (sid, cid, grade)
VALUES (123123, 'History105', 'A')
''')

IntegrityError: FOREIGN KEY constraint failed

#### Demonstrating ON DELETE options.
If we delete row from Students with sid 53650, what should happen with rows in Enrolled that refer to that student as a foreign key?
* NO ACTION
 * Essentially, don't allow.
 * This is the default for foreign key constraints if not otherwise specified.
* CASCADE
 * Deletes all rows from Enrolled that have that foreign key as well.
* SET NULL
 * Sets value to null
 * Allowed even if it would break primary key constraints
* SET DEFAULT
 * Only makes sense if that column has a default defined
 * Default value also subject to other constraints if applicable.

In [195]:
c.execute('''
DELETE FROM Students where sid = 53650
''')

IntegrityError: FOREIGN KEY constraint failed

In [196]:
c.execute("SELECT * from Enrolled")
for r in c:
    print(r)

(53688, 'Carnatic101', 'C')
(53688, 'Reggae203', 'B')
(53650, 'Topology112', 'A')
(53666, 'History105', 'B')